###파트 1
##한 줄로 출력할 때 각 숫자는 공백으로 구분하세요

#정수 N을 받은 후 그만큼 *을 1줄로 출력하세요

#***을 N줄만큼 출력하세요

#N과 M을 공백으로 구분해 두 개 받은 후 *을 가로 N줄, 세로 M줄만큼 출력하세요

#1부터 N까지 1줄로 출력하세요

#1부터 N까지 홀수만 출력하세요

#1부터 N까지 홀수를 전부 더해서 출력하세요

#1부터 N까지 홀수는 전부 몇 개인지 출력하세요


###파트 2

#숫자로 구성된 6개의 문자열을 입력받은 후, 각각 리스트에 원소로 저장하세요

#리스트의 첫 번째와 마지막 원소의 합을 출력하세요

#리스트를 거꾸로 출력하세요(슬라이싱으로)

#리스트를 거꾸로 출력하세요(반복문으로)

#리스트의 합을 구하되, SUM()메서드는 사용하지 마세요

#리스트의 원소의 갯수를 구하되, len()메서드는 사용하지 마세요

#리스트에서 홀수만 출력하세요

#리스트에서 홀수만 출력하되, 순서는 거꾸로 출력하세요

#리스트에서 N번째 숫자를 N번 한줄로 출력하세요

#리스트를 6번 반복해서 원소 36개짜리 리스트를 만드세요

#리스트에서 1,2,7,8,10,11,13,14...번(1번 시작) 원소를 뽑아서 한 줄로 출력하세요

###파트 3

#가로 N, 세로 M의 배열 matrix를 작성한 뒤, 0으로 전부 채우세요(반복문,append() 메서드 사용)

#가로 N, 세로 M의 배열을 matrix를 작성한 뒤, 0으로 전부 채우세요(리스트 컴프리헨션 사용)

#행 별로 각각 최대값을 구하여 출력하세요

#열 별로 각각 최소값을 구하여 출력하세요

#리스트를 좌우를 뒤집어 출력하세요

#리스트를 상하를 뒤집어 출력하세요

#2025년 2월 달력 calender_febuary 를 만드세요.
#달력에는 월~일요일과 날짜가 적혀있고, 1일은 월요일이라고 가정합니다

#방금 만든 달력이 실제 25년 2월 달력과 일치하게 만드세요

#달력에서 N일과 M+15일이 무슨 요일인지 구하세요. 28일이 넘으면 15일을 빼고 계산합니다

#정수 P를 입력받고, 달력에서 해당하는 날짜를 O로 바꾸세요

###파트 4(선택문제)

#1부터 30까지 적힌 리스트를 만드세요
#이 리스트를 무작위로 뒤섞으세요
##import random 후 random.suffle(lst) 메서드를 사용하세요

#이 리스트를 정렬하세요(선택정렬)
#이 리스트를 정렬하세요(버블정렬)